{
  "article": [
    {
      "img": "img/cultofthelamb.jpg",
      "gameName": "Cull Of The Lamb",
      "alt": "cullOfTheLamb",
      "title": "Cult of the Lamb Review",
      "article": "I began the game by naming each follower, designing them to look like one of my dogs, cat, or even my friends. But, after about a dozen hours, I was less engrossed with the simulation aspect of it all, opting to stick with default follower designs, and more focused on completing the next dungeon and upgrading the next building in my cult. That said, running through dungeons and improving my cult compound was satisfying, and I found plenty of enjoyment in Cult of the Lamb as a result, even when I felt more like a ruthless boss than a leader. \n\nIn the post-game cleanup, I’m only now engaging with the aesthetic-serving aspects of Cult of the Lamb. I’m finally making my cult feel like mine and not one I’m sure every other player will at some point make to cultivate as many resources as possible. I only wished I had felt this earlier in my 19-hour journey. Still, everything I did leading up to it, from the fast-paced dungeon combat that never grew stale to the factory-like base building that nailed the stress of resource management, was enough and then some to keep me engaged and indoctrinated.",
      "author": "WESLEY LEBLANC",
      "rating": "8",
      "date": "Aug 10, 2022",
      "type": "review"
    },
    {
      "img": "img/horizon-forbidden-west-kp-2560x1600.jpg",
      "gameName": "Horizon Zero Dawn Remake",
      "alt": "horizonNews",
      "title": "Horizon Zero Dawn Remake/Remaster And Horizon Multiplayer Game Reportedly In Development",
      "article": "A remake or remaster of 2017's Horizon Zero Dawn is reportedly in the works alongside a new Horizon multiplayer game.\n\nThis news comes by way of MP1st, which reports that its sources tell the publication that this remake/remaster will feature an improved lighting system, overhauled textures, better animations, and character models more in line with those of Horizon Forbidden West, Zero Dawn's sequel that released back in February. However, MP1ST notes that its sources didn't say whether this was a \"built from the ground up\" remake or a remaster – it might fall somewhere in between for all we know.\n\n\nAccording to MP1st, one of the project's big focuses (ha) is bringing Forbidden West's accessibility features over to Zero Dawn, something Sony did with The Last of Us Part II and Part I. As far as gameplay changes go, the publication says its sources say those will be mostly quality-of-life improvements. It also says it's unclear if this remake/remaster will be at the scale of The Last of Us Part I or something lesser. Only time will tell.",
      "author": "WESLEY LEBLANC",
      "date": "Oct 03, 2022",
      "type": "news"
    },
    {
      "img": "img/stadia_header.jpg",
      "gameName": "Google Stadia",
      "alt": "GoogleStadia",
      "title": "Stadia Will Close In January, Google Issuing Refunds For All Hardware And Software Purchases",
      "article": "Google has revealed that its cloud-streaming games service, Stadia, will shut down early next year. \n\nMore specifically, Stadia will close down its platform and end its online servers on January 18, 2023. After that, you won't be able to access the Stadia service in any way. As for your games and hardware, Google is offering refunds \"for all Stadia hardware purchases (Stadia controllers, Founders Edition, Premiere Edition, and Play and Watch with Google TV packages) through the Stadia store,\" according to an FAQ posted by Google today. It seems like the only aspect of Stadia that won't be refunded are Stadia Pro subscriptions. However, you \"will be able to continue playing your games in Pro without further charges until the final wind down date.",
      "author": "WESLEY LEBLANC",
      "date": "Sep 29, 2022",
      "type": "news"
    },
    {
      "img": "img/neonWhite.jpg",
      "gameName": "Neon White",
      "alt": "neonWhite",
      "title": "Neon White Review",
      "article": "You assume the role of Neon White; a dead assassin pulled from Hell for a divine competition. Demons overrun Heaven, so the powers that be task White and a host of damned with cleaning up the mess. The banished soul with the best – and fastest – score wins the opportunity to spend eternity in Heaven. They do this by running as fast as possible through various districts of the Pearly Gates, blowing away demons with a varying arsenal of heavenly guns.",
      "author": "BLAKE HESTER",
      "rating": "9.5",
      "date": "Jun 15, 2022",
      "type": "review"
    },
    {
      "img": "img/digimon3.jpg",
      "gameName": "Digimon Survive",
      "alt": "digimon",
      "title": "Digimon Survive Review",
      "article": "I applaud Digimon Survive for being a dark, harrowing, and wonderful visual novel, and subverting what I thought a Digimon story could be. While I wish the combat evolved as much as the surrounding story presentation, it’s not enough to deter someone from seeing the narrative through. Don’t expect a tactical masterpiece, but rather a well-made melancholy tale depicting Digimon in a light they haven’t been in before.",
      "author": "anonimus",
      "rating": "7",
      "date": "Aug 12, 2022",
      "type": "review"
    },
    {
      "img": "img/dynastyWarriors.jpg",
      "gameName": "Dynasty Warriors",
      "alt": "DynastyWarriors",
      "title": "Dynasty Warriors Studio Reveals Wild Hearts, A Monster Hunter-Like Game Coming Early Next Year",
      "article": "Electronic Arts and Koei Tecmo have revealed Wild Hearts, a new Monster Hunter-like game coming to PlayStation 5, Xbox Series X/S, and PC next year.\n\nMore specifically, this EA Originals title will be released on February 17, 2023. This news comes by way of the game's reveal trailer released today. In it, we see a lot of monster hunting action. The game seems to take place in a mythological land filled with large and dangerous beasts. You'll need to craft better gear to take on tougher monsters, eventually taming the otherwise wild area.",
      "author": "WESLEY LEBLANC",
      "date": "Sep 29, 2022",
      "type": "news"
    },
    {
      "img": "img/roller7.jpg",
      "gameName": "Rollerdrome",
      "alt": "digimon",
      "title": "Rollerdrome Review",
      "article": "My roller skates come to life, whirling loudly on concrete before drowning out to the murderous symphony of shotgun blasts and rocket explosions. I spin to avoid a hail of bullets, latch my skates onto a rail, and then flip through the air, my guns blazing as I perform a flashy trick to bring the crowd to its feet. I hope this run creates a big enough death combo to reach a high score and unlock the next stage, where more powerful weapons and foes await. This is Rollerdrome, a skating-shooter that blends the trick system of Tony Hawk's Pro Skater with the kill chains of Doom 2016 to create an exciting dystopian experience that makes you feel like a god on wheels.\n\nRoll7, the team behind the OlliOlli series, is locked in on every aspect of this game, delivering enticing skating freedom, challenges that require devotion, comic-book visuals that leap off the screen, and a fascinating science-fiction vision stripped right out of 1970s cinema. Rollerdrome is a love letter to James Caan's classic film Rollerball, following the same theme of corporations ruling the planet and using the poor as contestants in a blood sport. Even the skaters' uniforms are similar in design and color. The retro vibe and inspirations work well to create a fascinating backdrop to skate to. When playing Rollerdrome, the comparison points to other games and entertainment are crystal clear, but they unite to create something unique.",
      "author": "anonimus",
      "rating": "8.5",
      "date": "Aug 16, 2022",
      "type": "review"
    },
    {
      "img": "img/skull.jpg",
      "gameName": "Skull and Bones",
      "alt": "skullAndBones",
      "title": "Skull And Bones Delayed Again, This Time To March 2023",
      "article": "Skull and Bones has been delayed again, this time to March of next year. \n\nIt was originally due out in 2018 but then delayed to 2019. It was delayed to at least March 2020 after that, but things went quiet and the game missed that window. Then, in May of last year, Ubisoft announced that Skull and Bones would release sometime between April 1, 2022, and March 31, 2023. And now, it's slipping out of its November 8 release date, which was only just announced back in July, into a new March 9, 2023 date. As for why, the team cites a need for more polish and balancing.\n\nKotaku's Ethan Gach says sources say the teams working on Skull and Bones are burnt out. According to Gach in his Kotaku story, the latest technical test for the game ended on September 19. One source involved with the test told Kotaku that gameplay was more refined than in previous tests but that progression needed work as it still felt too shallow. Gach writes that this is a concern shared by multiple sources close to the game's development. ",
      "author": "WESLEY LEBLANC",
      "date": "Sep 28, 2022",
      "type": "news"
    },
    {
      "img": "img/entropy_centre.jpg",
      "gameName": "Entropy center",
      "alt": "portal",
      "title": "Portal-Like Puzzle Game, The Entropy Centre, Gets November Release Date",
      "article": "The Entropy Centre, an upcoming Portal-like sci-fi puzzle game coming from new studio Stubby Games, will be released this November. \n\nMore specifically, it will hit PlayStation 5, Xbox Series X/S, PlayStation 4, Xbox One, and PC on November 3. This news comes after a showing during the June Future Games Showcase, with The Entropy Centre's trailer garnering more than two million views in just 48 hours, according to a press release about today's news. To celebrate this November release date, Stubby Games has released a new trailer. ",
      "author": "WESLEY LEBLANC",
      "date": "Sep 29, 2022",
      "type": "news"
    },
    {
      "img": "img/overwatch_2_header.jpg",
      "gameName": "Overwatch 2",
      "alt": "overwatch2news",
      "title": "Overwatch 2: It Will Take New Players About 100 Matches To Unlock All Original Heroes",
      "article": "The new FTUE addresses that feedback directly. In phase one, players will need to unlock the game's modes and chat functions – this happens \"rapidly,\" Blizzard writes in the blog post. Then, in phase two, players will unlock the original Overwatch heroes by playing \"approximately 100 matches,\" according to Destructoid. It's important to note this is just for the original game's heroes – new heroes will be unlocked through Overwatch 2's battle pass system.\n\nCompetitive play can be unlocked by winning 50 Quick Play matches. However, Blizzard says, \"most FTUE restrictions are lifted while in a group, so new players can team up with their friends at any time to play almost any game modes.\" Competitive is the exception, though.\n\n\"While this [new FTUE] process helps players join the fun, it's also an effective way to discourage disruptive behaviour and cheating,\" the blog reads. \"FTUE is an investment to complete because it takes time to unlock game features – Competitive, specifically, cannot be accessed without winning matches. Disruptive players are unable to immediately affect the larger community, with things like voice chat and match chat unlocking later in FTUE. Brand-new accounts made by cheaters or disruptive players will have to play through this experience, giving us the chance to identify suspicious accounts before they enter other game modes.\"",
      "author": "Wesley LeBlanc",
      "date": "Sep 28, 2022",
      "type": "news"
    },
    {
      "img": "img/soulHackers.png",
      "gameName": "Soul Hackers 2",
      "alt": "soulHackers",
      "title": "Soul Hackers 2 Review",
      "article": "Throughout the 30 hours it took to hit credits, I kept trying to latch onto the elements that work. Soul Hackers 2’s saving grace lies in its main characters, each with a distinct personality that often clashes with the rest. Witnessing the group’s growth by putting their differences aside and opening themselves up to camaraderie was a joy. I loved their conversations about freelancing as Devil Summoners as much as the tough chats about the people they lost over a meal or a drink. But there’s not a seat on the table for the player to take it all in.\n\nDuring that night at the bar, the group wondered if they’d still be alive by the time the flowers bloomed again. And I know that they will because I put in the effort to make that happen. I just wish I was rewarded with a bit more humanity and meaning to my struggles by seeing them create that memory for themselves.",
      "author": "anonimus",
      "rating": "6.5",
      "date": "Aug 18, 2022",
      "type": "review"
    },
    {
      "img": "img/tmnt.png",
      "gameName": "Teenage Mutant Ninja Turtles: Shredder's Revenge",
      "alt": "tmnt",
      "title": "Teenage Mutant Ninja Turtles: Shredder's Revenge Review",
      "article": "I appreciate how Story mode’s objectives incentivized me to observe stages for collectibles, hidden characters, and traps to use against enemies. I wish side missions had more variety than “bring an ally this batch of collectibles” though. Story mode may not be a colossal shake-up, but it’s a neat twist worth playing if you already conquered Arcade.\n\nTeenage Mutant Ninja Turtles: Shredder’s Revenge gives me what I wanted: a polished, raucously fun throwback that plays better than how I remember the original games. Turtles fans new and old will find plenty to love, but those possessing a nostalgia for this era of the franchise are in for the biggest treat. Invite some friends, order a pizza, and prepare to relive your childhood in the best possible way.",
      "author": "MARCUS STEWART",
      "rating": "8.5",
      "date": "Jun 15, 2022",
      "type": "review"
    },
    {
      "img": "img/super-mario-odyssey_cappy.jpg",
      "gameName": "Super Mario Bros",
      "alt": "superMarioBros",
      "title": "Super Mario Bros. Movie Gets April Premiere Date, First Teaser Trailer Airs Next Month",
      "article": "Illumination’s Super Mario Bros. film will get its first teaser trailer next month. It also has a new premiere date for the movie following its delay in April. \n\nThe animated film, starring Chris Pratt as the titular plumber, will hit theaters on April 7, 2023. The biggest question regarding the film has been what Pratt’s Mario performance will sound like, and we may finally get to hear it in just a few weeks. The movie’s first teaser trailer premieres on October 6 at 4 p.m. ET during the New York Comic Con.",
      "author": "Marcus Stewart",
      "date": "Sep 22, 2022",
      "type": "news"
    }
  ],
  "users": {
  }
}